Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: If you add or modify such a subsystem in LVGL, whenever possible, the only ``#include`` that should be above those conditional directives should be just enough to include the enabling/disabling macro.
it_it: Se si aggiunge o si modifica un sottosistema di questo tipo in LVGL, ove possibile, l'unica ``#include`` che dovrebbe trovarsi sopra tali direttive condizionali dovrebbe essere sufficiente a includere la macro di abilitazione/disabilitazione.

source: If you added ``user_data`` to the Display, you can retrieve it in an event like this:
it_it: Se è stato aggiunto ``user_data`` al Display, lo si può recuperare in un evento come questo:

source: If you are a VSCode user, it is the best way to develop for Torizon OS.
it_it: VSCode, è il modo migliore per sviluppare per Torizon OS.

source: If you are adding your own Draw Unit(s), you add each available drawing unit to that list by calling :cpp:expr:`lv_draw_create_unit(sizeof(your_draw_unit_t))`.
it_it: Se si aggiungono le proprie Draw Unit, è possibile aggiungere ciascuna unità di disegno disponibile a tale elenco chiamando :cpp:expr:`lv_draw_create_unit(sizeof(your_draw_unit_t))`.

source: If you are building embedded software using LVGL, **this license does not affect you**.
it_it: Se si sviluppa software embedded utilizzando LVGL, **questa licenza non ha alcun effetto**.

source: If you are generating an image at run-time, you can craft an image variable to display it using LVGL.
it_it: Se si genera un'immagine a run-time, è possibile creare una variabile immagine per visualizzarla utilizzando LVGL.

source: If you are looking for contribution opportunities you can `Filter for these labels <https://github.com/lvgl/lvgl/labels>`__ :
it_it: Per cercare opportunità per contribuire, si può `Filtrare per queste etichette <https://github.com/lvgl/lvgl/labels>`__ :

source: If you are new to ESP-IDF, follow the instructions in the `ESP-IDF Programming guide <https://docs.espressif.com/projects/esp-idf/en/stable/esp32/get-started/index.html>`__ to install and set up ESP-IDF on your machine.
it_it: Se non si ha familiarità con ESP-IDF, seguire le istruzioni nella `ESP-IDF Programming guide <https://docs.espressif.com/projects/esp-idf/en/stable/esp32/get-started/index.html>`__ per installare e configurare ESP-IDF sul computer.

source: If you are not using a custom ``partition.csv`` yet, it can be added via ``menuconfig`` (``Partition Table → Partition Table → Custom partition table CSV``).
it_it: Se non si utilizza ancora un file ``partition.csv`` personalizzato, è possibile aggiungerlo tramite ``menuconfig`` (``Partition Table → Partition Table → Custom partition table CSV``).

source: If you are prompted to automatically install recommended extensions, click "install" so you can skip the next step.
it_it: Se viene richiesto di installare automaticamente le estensioni consigliate, cliccare su "Install" per saltare il passaggio successivo.

source: If you are unsure feel free to ask us in a comment, e.g. in your submitted :ref:`Pull Request <contributing_pull_requests>`.
it_it: In caso di dubbi, non esitare a contattarci in un commento, ad esempio nella :ref:`Pull Request <contributing_pull_requests>` inviata.

source: If you are using GCC-based toolchain, this can be taken care of by adding the following command-line options:
it_it: Se si utilizza una toolchain basata su GCC, è possibile risolvere il problema aggiungendo le seguenti opzioni da riga di comando:

source: If you are using GCC/CLANG you can add `-fdata-sections -ffunction-sections` compiler flags and `--gc-sections` linker flag to remove unused functions and variables from the final binary.
it_it: Se si utilizza GCC/CLANG, è possibile aggiungere i flag di compilazione `-fdata-sections -ffunction-sections` e il flag del linker `--gc-sections` per rimuovere funzioni e variabili non utilizzate dal binario finale.

source: If you are using `CMSIS-Pack <https://github.com/lvgl/lvgl/tree/master/env_support/cmsis-pack>`__ to deploy the LVGL.
it_it: Se si utilizza `CMSIS-Pack <https://github.com/lvgl/lvgl/tree/master/env_support/cmsis-pack>`__ per il deploy di LVGL.

source: If you are using a 16-bit system (causing the update of the Tick value to not be atomic) and your platform uses the Harvard instruction set, you can set a function like this as the callback passed to :cpp:expr:`lv_tick_set_cb(my_get_milliseconds)`:
it_it: Se si utilizza un sistema a 16 bit (per cui l'aggiornamento del valore Tick non è atomico) e la piattaforma utilizza il set di istruzioni Harvard, è possibile impostare una funzione come questa come callback passata a :cpp:expr:`lv_tick_set_cb(my_get_milliseconds)`:

source: If you are using an OS and wish to get the time the CPU is spending in an idle thread, one way of doing so is configuring :c:macro:`LV_USE_SYSMON` and :c:macro:`LV_USE_PERF_MONITOR` to ``1`` in ``lv_conf.h`` (if they are not already), and setting the macro :c:macro:`LV_SYSMON_GET_IDLE` to the name of a function that fetches the percent of CPU time spent in the OS's idle thread.
it_it: Se si utilizza un sistema operativo e si desidera ottenere il tempo trascorso dalla CPU in un thread inattivo, un modo per farlo è configurare :c:macro:`LV_USE_SYSMON` e :c:macro:`LV_USE_PERF_MONITOR` a ``1`` in ``lv_conf.h`` (se non lo sono già) e impostare la macro :c:macro:`LV_SYSMON_GET_IDLE` con il nome di una funzione che recupera la percentuale di tempo della CPU trascorso nel thread inattivo del sistema operativo.

source: If you are using an OS, there are a few other options.
it_it: Se si sta utilizzando un sistema operativo, ci sono alcune altre opzioni.

source: If you are using one of the following file-system drivers:
it_it: Se si utilizza uno dei seguenti driver del file system:

source: If you are using the Arduino GIGA Display Shield (docs `here <https://docs.arduino.cc/hardware/giga-display-shield>`__), use the `Arduino_H7_Video <https://github.com/arduino/ArduinoCore-mbed/tree/main/libraries/Arduino_H7_Video>`__ library, included in the Arduino Mbed OS board package (`here <https://github.com/arduino/ArduinoCore-mbed>`__), which provides built-in LVGL compatibility.
it_it: Se si utilizza Arduino GIGA Display Shield (la documentazione `qui <https://docs.arduino.cc/hardware/giga-display-shield>`__), utilizzare la libreria `Arduino_H7_Video <https://github.com/arduino/ArduinoCore-mbed/tree/main/libraries/Arduino_H7_Video>`__, inclusa nel pacchetto della scheda Arduino Mbed OS (`qui <https://github.com/arduino/ArduinoCore-mbed>`__), che fornisce compatibilità LVGL integrata.

source: If you attempt to do so, LVGL will generate an assertion failure with a message indicating that invalidating an area is not allowed during rendering.
it_it: Se si tenta di farlo, LVGL genererà un errore di asserzione con un messaggio che indica che l'invalidazione di un'area non è consentita durante il rendering.

source: If you can do this with your display then you can use it with LVGL.
it_it: Se lo si può fare col proprio display, lo si può usare con LVGL.

source: If you can't determine your input device, first run
it_it: Se non si riesce a determinare il dispositivo di input, eseguire prima

source: If you can't use ``printf`` or want to use a custom function to log, you can register a "logging" function with :cpp:func:`lv_log_register_print_cb`.
it_it: Se non è possibile utilizzare ``printf`` o per utilizzare una funzione personalizzata per il log, si può registrare una funzione di "logging" con :cpp:func:`lv_log_register_print_cb`.

source: If you choose to build a library then you do not need to follow the instructions in the previous section.**
it_it: Se si sceglie di compilare una libreria, non è necessario seguire le istruzioni della sezione precedente.**

source: If you copied the ``figma_node_id="..."`` part from the plugin, the style in the XML is connected to a specific element in Figma, and the Editor can download the style properties.
it_it: Se è stata copiata la parte ``figma_node_id="..."`` dal plugin, lo stile nell'XML è collegato a un elemento specifico in Figma e l'Editor può scaricare le proprietà di stile.

source: If you create a new directory you will need an index.rst file in that directory and that index file needs to be pointed to in the index.rst file that is located in the parent directory.
it_it: Se si crea una nuova directory, sarà necessario un file index.rst in quella directory e tale file indice deve essere puntato nel file index.rst che si trova nella directory padre.

source: If you create a new pair of ``.c`` and ``.h`` files (e.g. for a new driver), ensure a Doxygen comment like this is at the top of each new file.
it_it: Se si crea una nuova coppia di file ``.c`` e ``.h`` (ad esempio per un nuovo driver), assicurarsi che un commento Doxygen come questo sia presente all'inizio di ogni nuovo file.

source: If you do not use long text, you can save 12 bytes per label by setting it to ``0``.
it_it: Se non si utilizza testo lungo, è possibile risparmiare 12 byte per etichetta impostandolo su ``0``.

source: If you do this, you will need to exclude the configured FreeType library's ``ftsystem.c`` file from being compiled, since LVGL's ``lv_ftsystem.c`` has custom versions of the functions defined therein.
it_it: In questo caso, sarà necessario escludere dalla compilazione il file ``ftsystem.c`` della libreria FreeType configurata, poiché ``lv_ftsystem.c`` di LVGL contiene versioni personalizzate delle funzioni definite al suo interno.

source: If you do:
it_it: In tal caso:

source: If you don't enable looping, a :cpp:enumerator:`LV_EVENT_READY` is sent when the animation cannot make more progress without looping.
it_it: Se non si abilita il loop, viene inviato un :cpp:enumerator:`LV_EVENT_READY` quando l'animazione non può procedere oltre senza loop.

source: If you don't have an STM32F429I-DISCO, this process will be similar for other boards.
it_it: Se non si ha una STM32F429I-DISCO, questa procedura sarà simile per altre schede.

source: If you don't know the index of an option can also select an item with :cpp:expr:`lv_roller_set_selected_str(roller, str, LV_ANIM_ON)`, where *str* is the string equal to one of the list items.
it_it: Se non si conosce l'indice di un'opzione, è possibile selezionare un elemento anche con :cpp:expr:`lv_roller_set_selected_str(roller, str, LV_ANIM_ON)`, dove *str* la stringa corrispondente a uno degli elementi dell'elenco.

source: If you don't want this, to automatically rotate the labels to keep them upright, an additional flag can be used.
it_it: Se non si desidera che ciò avvenga, è possibile utilizzare un flag aggiuntivo per ruotare automaticamente le etichette e mantenerle in posizione verticale.

source: If you don't want to use the built-in Pinyin dictionary, or if you feel that the built-in phonetic dictionary consumes too much memory, you can use a custom dictionary.
it_it: Se non si desidera utilizzare il dizionario Pinyin integrato o se si ritiene che il dizionario fonetico integrato consumi troppa memoria, è possibile utilizzare un dizionario personalizzato.

source: If you don't want to use the built-in dictionary, you can disable :c:macro:`LV_IME_PINYIN_USE_DEFAULT_DICT` in ``lv_conf.h``, which can save a lot of memory space.
it_it: Se non si vuole usare il dizionario nativo, si può disabilitare :c:macro:`LV_IME_PINYIN_USE_DEFAULT_DICT` in ``lv_conf.h``, il che può far risparmiare molto spazio di memoria.

source: If you double click the ``.AppImage`` file and nothing happens, try running it from the terminal.
it_it: Se si fa doppio clic sul file ``.AppImage`` e non succede nulla, provare ad eseguirlo dal terminale.

source: If you enable FreeRTOS or CMSIS RTOS in your STM32 HAL project, you can enable LVGL's support for the corresponding RTOS and LVGL will use the thread creation and synchronization primitives of the respective RTOS when rendering, depending on the renderers enabled.
it_it: Abilitando FreeRTOS o CMSIS RTOS nel progetto HAL STM32, è possibile abilitare il supporto LVGL per il corrispondente RTOS e LVGL utilizzerà le primitive di creazione e sincronizzazione dei thread del rispettivo RTOS durante il rendering, a seconda dei renderer abilitati.

source: If you enable it, LVGL will use the NuttX heap instead.
it_it: Se lo si abilita, LVGL utilizzerà invece l'heap NuttX.

source: If you followed the previous steps, here are the folders you will find:
it_it: Se sono stati seguiti i passaggi precedenti, ecco le cartelle che si troveranno:

source: If you have POSIX environment support, you can enable :c:macro:`LV_USE_PROFILER_BUILTIN_POSIX`.
it_it: Se si dispone del supporto per l'ambiente POSIX, è possibile abilitare :c:macro:`LV_USE_PROFILER_BUILTIN_POSIX`.

source: If you have a file-based image type that is not in the above list, you can set up LVGL to successfully handle it by implementing a custom image decoder.
it_it: Se si dispone di un tipo di immagine basato su file non presente nell'elenco precedente, è possibile configurare LVGL per gestirlo correttamente implementando un decodificatore di immagini personalizzato.

source: If you have a frogfs blob stored in a different :ref:`filesystem <file_system>` accessible to LVGL, you can load the blob into ram and register it from there.
it_it: Se si dispone di un blob frogfs memorizzato in un :ref:`filesystem <file_system>` diverso accessibile a LVGL, è possibile caricare il blob in RAM e registrarlo da lì.

source: If you have an STM32 board with a display mounted to it, it's best to initialize your project with STM32CubeIDE or STM32CubeMX by finding your board in the board selector.
it_it: Se si dispone di una scheda STM32 con un display montato, è consigliabile inizializzare il progetto con STM32CubeIDE o STM32CubeMX individuando la scheda nel selettore delle schede.

source: If you have many devices connected this can get quite slow.
it_it: Se si hanno molti dispositivi collegati, l'operazione può risultare piuttosto lenta.

source: If you have more than one, and especially if they run concurrently, it is better to use the shared library.
it_it: Se ce n'è più di una, e soprattutto se vengono eseguite contemporaneamente, è meglio utilizzare la libreria condivisa.

source: If you have multiple displays call :cpp:expr:`lv_display_set_default(display1)` to select the display to refresh before :cpp:expr:`lv_display_refr_timer(NULL)`.
it_it: Se si dispone di più display, si chiama :cpp:expr:`lv_display_set_default(display1)` per selezionare il display da aggiornare prima di :cpp:expr:`lv_display_refr_timer(NULL)`.

source: If you have multiple displays, you must ensure the default display is set to the one your input device is "connected to" before making the above calls.
it_it: Se si hanno più display, si deve impostare il display di default su quello a cui è "collegato" il dispositivo di input prima di effettuare le chiamate di cui sopra.

source: If you have questions go to the `Forum`_.
it_it: Se ci sono domande, visitare il `Forum`_.

source: If you have, for instance, created a button obj in the main Page.
it_it: Se, ad esempio, è stato creato un oggetto button nella Pagina principale.

source: If you haven't already done so, now is a good time to get familiar with setting up and configuring this library.
it_it: Se non è stato già fatto, ora è il momento giusto per familiarizzare con l'installazione e la configurazione di questa libreria.

source: If you haven't already done so, you will need to learn about the LVGL :ref:`File System abstraction <file_system>`, since it must be set up and be functional for File Explorer to work.
it_it: Se non è stato già fatto, si dovrà imparare a conoscere l':ref:`astrazione del File System <file_system>` LVGL, poiché deve essere configurata e funzionante affinché File Explorer funzioni.

source: If you hold the keys, it will simulate encoder movement with the period specified in ``indev.long_press_repeat_time``.
it_it: Se si tengono premuti i tasti, verrà simulato il movimento dell'encoder con il periodo specificato in ``indev.long_press_repeat_time``.

source: If you just want to delete a Widget and don't need to clean anything up in ``my_screen_cleanup`` you could just use :cpp:expr:`lv_obj_delete_async(widget)` which will delete the Widget on the next call to :cpp:func:`lv_timer_handler`.
it_it: Per eliminare un widget e non c'è bisogno di pulire nulla in ``my_screen_cleanup``, si può semplicemente usare :cpp:expr:`lv_obj_delete_async(widget)`, che eliminerà il Widget alla successiva chiamata a :cpp:func:`lv_timer_handler`.

source: If you kept a copy of the pointer returned by :cpp:func:`lv_anim_start` as ``running_anim``, you can delete the running animation like this:
it_it: Se è stata conservata una copia del puntatore restituito da :cpp:func:`lv_anim_start` come ``running_anim``, si può eliminare l'animazione in esecuzione in questo modo:

source: If you kept a copy of the pointer returned by :cpp:func:`lv_anim_start`, you can pause the running animation using :cpp:expr:`lv_anim_pause(animation)` and then resume it using :cpp:expr:`lv_anim_resume(animation)`.
it_it: Se è stata conservata una copia del puntatore restituito da :cpp:func:`lv_anim_start`, si può mettere in pausa l'animazione in esecuzione utilizzando :cpp:expr:`lv_anim_pause(animation)` e poi riprenderla utilizzando :cpp:expr:`lv_anim_resume(animation)`.

source: If you know that the changed properties can be applied by a simple redraw (e.g. color or opacity changes) just call :cpp:expr:`lv_obj_invalidate(widget)` or :cpp:expr:`lv_obj_invalidate(lv_screen_active())`.
it_it: Se si sa che le proprietà modificate possono essere applicate con un semplice ridisegno (ad esempio, modifiche di colore o opacità), si chiama semplicemente :cpp:expr:`lv_obj_invalidate(widget)` o :cpp:expr:`lv_obj_invalidate(lv_screen_active())`.

source: If you know what DMA is, it's similar to a memory-to-memory DMA engine and can even be used like one, but allows specifying source and destination stride and converting the data it's moving from one pixel format to another.
it_it: È simile a un motore DMA da memoria a memoria e può anche essere utilizzato come tale, ma consente di specificare lo "stride" di origine e destinazione e di convertire i dati che sposta da un formato pixel a un altro.

source: If you need a different range, set it before chart is drawn.
it_it: Se è necessario un intervallo diverso, impostarlo prima di disegnare il grafico.

source: If you need a substitution that is not already in substitutions.txt, please add it.
it_it: Se c'è bisogno di una sostituzione che non è già presente in substitutions.txt, aggiungerla.

source: If you need another color format, use the :ref:`offline converter <images_offline_converter>`.
it_it: Se c'è bisogno di un altro formato colore, si usa il :ref:`convertitore offline <images_offline_converter>`.

source: If you need events to propagate to deeper levels, each child would need to have the :cpp:enumerator:`LV_OBJ_FLAG_EVENT_TRICKLE` flag enabled.
it_it: Affinché gli eventi si propaghino a livelli più profondi, ogni widget figlio deve avere il flag :cpp:enumerator:`LV_OBJ_FLAG_EVENT_TRICKLE` abilitato.

source: If you need it to have a different shape, orientation or tick position, use :cpp:expr:`lv_scale_set_mode(scale, mode)`, where ``mode`` can be any of these values:
it_it: Se c'è bisogno di una forma, un orientamento o una posizione di tacca diversa, si usa :cpp:expr:`lv_scale_set_mode(scale, mode)`, dove ``mode`` può essere uno qualsiasi di questi valori:

source: If you need support for SVG animation attribute parsing, you can set :c:macro:`LV_USE_SVG_ANIMATION` in ``lv_conf.h`` to ``1``.
it_it: Se è necessario il supporto per l'analisi degli attributi di animazione SVG, è possibile impostare :c:macro:`LV_USE_SVG_ANIMATION` in ``lv_conf.h`` a ``1``.

source: If you need to add a property that is not present, it is recommended to add it in the ``enum`` near the top of the Widget's primary ``.h`` file, and re-generate these lists using ``./scripts/properties.py`` to ensure alphabetical ordering is preserved.
it_it: Se è necessario aggiungere una proprietà non presente, si consiglia di aggiungerla in ``enum`` nella parte superiore del file ``.h`` primario del Widget e di rigenerare questi elenchi utilizzando ``./scripts/properties.py`` per garantire che l'ordinamento alfabetico venga mantenuto.

source: If you need to customize your own thesaurus according to the Hanyu Pinyin syllable table, you can read `here <https://baike.baidu.com/item/%E6%B1%89%E8%AF%AD%E6%8B%BC%E9%9F%B3%E9%9F%B3%E8%8A%82/9167981>`__ to learn about the Hanyu Pinyin syllables and the syllable table.
it_it: Se c'è bisogno di personalizzare il dizionario dei sinonimi in base alla tabella sillabica Hanyu Pinyin, si può leggere `qui <https://baike.baidu.com/item/%E6%B1%89%E8%AF%AD%E6%8B%BC%E9%9F%B3%E9%9F%B3%E8%8A%82/9167981>`__ per saperne di più sulle sillabe Hanyu Pinyin e sulla tabella sillabica.

source: If you need to delete a Widget during Animation, be sure to delete the Animation Timeline before deleting the Widget.
it_it: Per eliminare un Widget durante l'Animazione, assicurarsi di eliminare la Timeline dell'animazione prima di eliminare il widget.

source: If you need to make more changes, just update your forked ``lvgl`` repo with new commits.
it_it: Per apportare ulteriori modifiche, aggiornare il proprio repository ``lvgl`` forkato con nuovi commit.

source: If you need to programmatically deal with selected text, in addition to the :cpp:expr:`lv_textarea_set_text_selection(textarea, enable)` function, the following is your tool set for doing so.
it_it: Se è necessario gestire il testo selezionato a livello di codice, oltre alla funzione :cpp:expr:`lv_textarea_set_text_selection(textarea, enable)`, ecco gli strumenti a disposizione.

source: If you need to re-modify the size and color, use :cpp:func:`lv_qrcode_set_size` and :cpp:func:`lv_qrcode_set_dark_color` or :cpp:func:`lv_qrcode_set_light_color` respectively, and then call :cpp:func:`lv_qrcode_update` again to update the QR Code.
it_it: Se è necessario modificare nuovamente le dimensioni e il colore, utilizzare rispettivamente :cpp:func:`lv_qrcode_set_size` e :cpp:func:`lv_qrcode_set_dark_color` o :cpp:func:`lv_qrcode_set_light_color`, quindi richiamare :cpp:func:`lv_qrcode_update` per aggiornare il codice QR.

source: If you need world-space coordinates (position in global scene coordinates rather than relative to parent), use the world position variant.
it_it: Se sono necessarie coordinate globali (posizione nelle coordinate della scena globale anziché relativa al padre), si usa la variante relativa alla posizione globale.

source: If you only see "Reactivate Environment" then it is likely already active.
it_it: Se si vede solo "Reactivate Environment", è probabile che sia già attivo.

source: If you pass ``false`` to this function to disable text selection, any text selected time of the call will be de-selected.
it_it: Se si passa ``false`` a questa funzione per disabilitare la selezione del testo, qualsiasi testo selezionato al momento della chiamata verrà deselezionato.

source: If you performed some action on a gesture, you can call :cpp:expr:`lv_indev_wait_release(lv_indev_active())` in the event handler to prevent LVGL from sending further input-device-related events.
it_it: Se si esegue un'azione su un gesto, è possibile chiamare :cpp:expr:`lv_indev_wait_release(lv_indev_active())` nel gestore eventi per impedire a LVGL di inviare ulteriori eventi relativi al dispositivo di input.
